# Parameters
nc: 80 # number of classes
use: n
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [9, 1, nn.Upsample, [None, 4, "nearest"]] # 14
  - [[-2, -1, 4], 1, Concat, [1]] # 15
  - [-1, 3, C2f, [256]] # 16

  - [-1, 1, DeformConv, [256, 3, 2]] # 17
  - [[-1, 12], 1, Concat, [1]] # 18
  - [-1, 3, C2f, [512]] # 19

  - [-1, 1, DeformConv, [512, 3, 2]] # 20
  - [16, 1, DeformConv, [256, 3, 4]] # 21
  - [[-2, -1, 9], 1, Concat, [1]] # 22
  - [-1, 3, C2f, [1024]] # 23

  - [[16, 19, 23], 1, Detect, [nc]] # Detect
