# Parameters
nc: 80 # number of classes
use: n
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]] # 10
  - [-1, 1, ShuffleAttention, [128]] # 11
  - [[-1, 4], 1, Concat, [1]] # 12
  - [-1, 3, C2f, [512]] # 13

  - [9, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [-1, 1, ShuffleAttention, [128]] # 15
  - [[-1, 6], 1, Concat, [1]] # 16
  - [-1, 3, C2f, [512]] # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [-1, 1, ShuffleAttention, [128]] # 19
  - [[-1, 13], 1, Concat, [1]] # 20
  - [-1, 3, C2f, [256]] # 21

  - [-1, 1, Conv, [256, 3, 4]] # 22
  - [[-1, 9], 1, Concat, [1]] # 23
  - [-1, 3, C2f, [512]] # 24

  - [21, 1, Conv, [256, 3, 2]] # 25
  - [[-1, 17], 1, Concat, [1]] # 26
  - [-1, 3, C2f, [512]] # 27

  - [-1, 1, Conv, [512, 3, 2]] # 28
  - [[-1, 24], 1, Concat, [1]] # 29
  - [-1, 3, C2f, [1024]] # 30

  - [[21, 27, 30], 1, Detect, [nc]] # Detect
