# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, ShuffleAttention, [16]] # 3
  - [-1, 1, Conv, [256, 3, 2]] # 4
  - [-1, 6, C2f, [256, True]] # 5
  - [-1, 1, ShuffleAttention, [32]] # 6
  - [-1, 1, Conv, [512, 3, 2]] # 7
  - [-1, 6, C2f, [512, True]] # 8
  - [-1, 1, ShuffleAttention, [64]] # 9
  - [-1, 1, Conv, [1024, 3, 2]] # 10
  - [-1, 3, C2f, [1024, True]] # 11
  - [-1, 1, ShuffleAttention, [128]] # 12
  - [-1, 1, SPPF, [1024, 5]] # 13

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 19

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 22

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 25

  - [[19, 22, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)
