# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [6, 1, ShuffleAttention, [64]] # 10
  - [9, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 10], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 13

  - [4, 1, ShuffleAttention, [32]] # 14
  - [13, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 14], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 17 (P3/8-small)

  - [-1, 1, ShuffleAttention, [32]] # 18
  - [13, 1, ShuffleAttention, [64]] # 19
  - [18, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 19], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 25 (P5/32-large)

  - [[17, 22, 25], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)
