# Parameters
nc: 80 # number of classes
use: n
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]] # 10
  - [[-1, 4], 1, Concat, [1]] # 11
  - [-1, 3, C2f, [512]] # 12

  - [9, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 6], 1, Concat, [1]] # 14
  - [-1, 3, C2f, [512]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  - [[-1, 12], 1, Concat, [1]] # 17
  - [-1, 3, C2f, [256]] # 18

  - [-1, 1, Conv, [256, 3, 4]] # 19
  - [[-1, 9], 1, Concat, [1]] # 20
  - [-1, 3, C2f, [512]] # 21

  - [18, 1, Conv, [256, 3, 2]] # 22
  - [[-1, 15], 1, Concat, [1]] # 23
  - [-1, 3, C2f, [512]] # 24

  - [-1, 1, Conv, [512, 3, 2]] # 25
  - [[-1, 21], 1, Concat, [1]] # 26
  - [-1, 3, C2f, [1024]] # 27

  - [[18, 24, 27], 1, OBB, [nc, 1]] # OBB
